[
  {
    "title": "Step 1: Set Up Supabase Account",
    "content": "Go to https://supabase.io and sign up for a new account. Once signed in, create a new project and select a region for your database. Supabase will automatically create a PostgreSQL database for you. Although, through this guide you will be able to pick the right settings and make them work. Generally speaking, Supabase docs are quite well written and you should follow them in order to simplify your workflow, especially for seeing how to use their API (as it won't be covered here). As always, don't forget RTFM."
  },
  {
    "title": "Step 2: Create a Table for Messages",
    "content": "In your Supabase dashboard, navigate to the 'Database' tab. Go to the 'Tables' section and create a new table named 'messages' or whatever the name you would like to use across the project. Add columns such as 'id' (UUID, primary key), created_at (timestamptz), 'email_sender' (text), 'email_receiver' (text), and 'message' (text). Optionally, you can add any other column that you believe usefull for your project.",
    "image": "Supabase_step2.JPG"
  },
  {
    "title": "Step 3: Set Permissions for the Messages Table",
    "content": "In the Supabase dashboard, go to the 'Auth Policies' tab. Click on create a new policy for each action you would like to allow (Insert, Select, Update, Delete). For basic chat functionality, allow all authenticated users to insert and select messages. For doing so, you can choose between using a SQL query terminal or the UI provided by Supabase. After finishing this step, you will have a table with the permissions set up for the actions you want to allow. So, it could be a good moment to test the permissions by trying to insert a new message in the table from your site. Be aware that you will need to authenticate your user before doing so.",
    "image": "Supabase_step3.JPG"
  },
  {
    "title": "Step 4: Enable Realtime Functionality",
    "content": "To allow your chat application to receive real-time updates, go to your 'Table Editor' and click on the 'Realtime' at the top-right of supabase UI. Enable the 'Realtime' feature for the 'messages' table. This will allow your application to listen for changes in the table, such as new messages being added.",
    "image": "Supabase_step4.JPG"
  },
  {
    "title": "Step 5: Set Up Supabase Authentication",
    "content": "Navigate to the 'Auth' tab in your Supabase dashboard and choose 'Providers'. Enable 'Google' as a provider. You will need to configure this by providing your Google Client ID and Client Secret, which you will obtain from the Google Cloud Console.",
    "image": "Supabase_step5.JPG"
  },
  {
    "title": "Step 6: Configure Google Cloud Console for OAuth",
    "content": "Go to https://console.cloud.google.com and create a new project. Navigate to 'APIs & Services' > 'Credentials' and create an OAuth 2.0 Client ID. Set the application type as 'Web application' and provide the authorized redirect URIs (from your Supabase dashboard). Copy the Client ID and Client Secret and paste them back into your Supabase dashboard under the Google provider settings.",
    "image": "Supabase_step6.JPG"
  },
  {
    "title": "Step 7: Connect the Frontend to Supabase",
    "content": "Install the Supabase client in your frontend project by running 'npm install @supabase/supabase-js'. Initialize the Supabase client with your Supabase URL and anon public key. It's highly recommended to keep those keys as a secrets, saving them into a '.env' file and avoid pushing them to a public repository. Use the authentication methods provided by Supabase to allow users to log in via Google."
  },
  {
    "title": "Step 8: Fetch and Send Messages",
    "content": "Use Supabase's JavaScript library to fetch messages from the 'messages' table. Set up a function to insert new messages into the table when a user sends a message. Use Supabase's realtime subscription feature to listen for new messages and update the chat in real time."
  },
  {
    "title": "Step 9: Deploy Your Application",
    "content": "Once your application is ready, deploy it using a service like Vercel, Netlify, or another preferred hosting platform. Make sure your environment variables for Supabase URL and anon key are properly set up in your hosting platform."
  },
  {
    "title": "Step 10: Test Your Chat Application",
    "content": "Test the chat functionality by signing in with different Google accounts and exchanging messages. Ensure that private messages are displayed correctly and that global messages are visible when no receiver is specified."
  }
]
